In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
ser1 = Series([0,1,2], index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int64

In [4]:
ser2 = Series([3,4,5,6], index=['a','b','c','d'])
ser2

a    3
b    4
c    5
d    6
dtype: int64

In [5]:
ser1 + ser2

a    3.0
b    5.0
c    7.0
d    NaN
dtype: float64

In [11]:
dframe1 = DataFrame(np.arange(4).reshape(2,2), index=['LA', 'SA'], columns=list('AB'))
dframe1

    A  B
LA  0  1
SA  2  3

In [18]:
dframe2 = DataFrame(np.arange(9).reshape(3,3), index=['LA', 'SF', 'NYC'] , columns=['A','B', 'E'])
dframe2

     A  B  E
LA   0  1  2
SF   3  4  5
NYC  6  7  8

In [15]:
dframe1 + dframe2

       A   B   D   E
LA   0.0 NaN NaN NaN
NYC  NaN NaN NaN NaN
SA   NaN NaN NaN NaN
SF   NaN NaN NaN NaN

In [20]:
# using fill_value = 0 prevents you from losing data when adding matrices with null values in some of the fields
dframe1.add(dframe2, fill_value=0)

       A    B    E
LA   0.0  2.0  2.0
NYC  6.0  7.0  8.0
SA   2.0  3.0  NaN
SF   3.0  4.0  5.0

In [21]:
dframe2

     A  B  E
LA   0  1  2
SF   3  4  5
NYC  6  7  8

In [24]:
ser3 = dframe2.ix[0]
ser3

A    0
B    1
E    2
Name: LA, dtype: int64

In [25]:
dframe2-ser3

     A  B  E
LA   0  0  0
SF   3  3  3
NYC  6  6  6